package HomeWork220924Cycles;

public class Task8 {
    /**
     * Дано целое число, лежащее в диапазоне от 1 до 999. Если число двузначное,
     * выведите строку "Двузначное", если число содержит одну значащую цифру, то
     * выведите строку "Цифра", если число является трехзначным выведите
     * "Трехзначное". В случае, если введенное число меньше 0 или больше 999,
     * выведите строку "Ошибка!".
     */
    public static void main(String[] args) {
        int a = 777;
        if (1 <= a && a <=9) {
            System.out.println("Цифра");
        } else if (10 <= a && a <= 99) {
            System.out.println("Двузначное");
        } else if (100 <= a && a <= 999) {
            System.out.println("Трехзначное");
        } else {
            System.out.println("Ошибка");
        }
    }
}
