package HomeWork220924Cycles;

public class Task5 {
    /**Пользователь вводит текущее время в часах. Если количество часов находится в
     * диапазоне от 0 до 7, то программа выводит строку "Ночь". Если часовая стрелка
     * находится между 7 и 11, то выведется строка "Утро". От 12 до 17 выведется
     * строка "День". Если текущее время находится между 17 и 23, то программа
     * должна вывести строку "Вечер". В случае, когда введенное число отрицательно
     * или превосходит 23, программа должна вывести строку "Ошибка".
     */
    public static void main(String[] args) {
        int time = 24;
        if (0 <= time && time <= 7) {
            System.out.println("Ночь");
        } else if (7 <= time && time <= 11) {
            System.out.println("Утро");
        } else if (12 <= time && time <= 17) {
            System.out.println("День");
        } else if (17 <= time && time <= 23) {
            System.out.println("Вечер");
        } else {
            System.out.println("Ошибка");
        }
    }
}
