package kata;

/**
 * В городе N проезд в трамвае осуществляется по бумажным отрывным
 * билетам. Каждую неделю трамвайное депо заказывает в местной типографии
 * рулон билетов с номерами от 000001 до 999999. «Счастливым» считается
 * билетик у которого сумма первых трёх цифр номера равна сумме последних
 * трёх цифр, как, например, в билетах с номерами 003102 или 567576.
 * Трамвайное депо решило подарить сувенир обладателю каждого счастливого
 * билета и теперь раздумывает, как много сувениров потребуется. С помощью
 * программы подсчитайте сколько счастливых билетов в одном рулоне?
 */

public class Task3 {
    public static void main(String[] args) {
        searchLuckyTickets(999999);
    }

    static void searchLuckyTickets (int maxNumberOfTickets) {
        int count = 0;

        for (int i = 1; i < maxNumberOfTickets; i++) {
            int digit5 = i / 100000;
            int digit4 = (i / 10000) % 10;
            int digit3 = (i / 1000) % 10;
            int digit2 = (i / 100) % 10;
            int digit1 = (i / 10) % 10;
            int digit0 = i % 10;
            if (digit5 + digit4 + digit3 == digit2 + digit1 + digit0) {
                count++;
            }
        }
        System.out.println("Количество счастливых билетов: " + count);
    }
}

