package problemSecond;

/**
 * Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
 * Если год является високосным, то выведите "Год является високосным", иначе выведите "Не високосный". Напомним,
 * что в соответствии
 * с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100,
 * а также если он кратен 400.
 *
 * Если год делится на 4 без остатка, но делится на 100 только с остатком, то он високосный,
 * иначе — невисокосный, кроме случая, если он делится без остатка на 400 — тогда он всё равно високосный
 */

public class ConditionalStatements {
    private int year;

    public ConditionalStatements (int year) {
        this.year = year;
    }

    public void isLeapYear () {
        if (year % 4 == 0 && year % 100 != 0 || year % 400 == 0) { // тут мы проверим условия задачи.
            System.out.println("Год является високосным");
        } else {
            System.out.println("Не високосный");
        }
    }
}
/**
 * Условные операторы - это операторы, которые позволяют программе выполнять различные действия в
 * зависимости от значения какого-либо условия. В языке Java есть два условных оператора: if и тернарный оператор.
 * Оператор if проверяет, является ли условие истинным, и выполняет определенный блок кода, если это так.
 * Тернарный оператор - это сокращенная форма записи оператора if.
 */





